IDEA Open Model
CheckMember Class
 Check member base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.CheckMember
 IdeaRS.OpenModel.Model.CheckMember1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public abstract class CheckMember : OpenElementId
Public MustInherit Class CheckMember
	Inherits OpenElementId
public ref class CheckMember abstract : public OpenElementId
The CheckMember type exposes the following members.
Constructors
Name | Description
CheckMember
 Constructor
Top
Properties
Name | Description
Id
 Element Id
 (Inherited from OpenElementId.)
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace